{
  "backend/main.mo": "Main actor for a clinic management system on the Internet Computer, defining data types (Appointment, Patient, Lead, Prescription, etc.) and managing per-user data stores for appointments, patients, leads, staff, attendance, and WhatsApp templates with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms old user data structures to new ones during canister upgrades, specifically adding the `assignedDoctor` field to appointments and updating patient image/prescription blob references.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (doctor assignment dropdown, next appointment widget update, calendar resize) to their corresponding source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "A JSON document containing one-line summaries of every frontend source file, describing the purpose and key implementation details of each component, page, hook, and utility.",
  "frontend/GO_LIVE.md": "Step-by-step deployment guide for pushing the McDerma Clinic Management app to the Internet Computer mainnet, including prerequisites, a pre-deployment checklist, and deployment steps.",
  "frontend/index.css": "Global stylesheet that sets up Tailwind CSS directives and defines CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Main HTML entry point for the McDerma Clinic Management System that mounts the React app and registers a service worker for PWA support.",
  "frontend/public/manifest.json": "PWA web app manifest defining the app name, icons, display mode, and theme for the McDerma Clinic Management System.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for static assets and network-first for navigation, while bypassing caching for API calls.",
  "frontend/QA_APPOINTMENTS_ID_REGRESSION_TEST.md": "QA regression test plan with eight scenarios verifying that appointment edit and delete operations correctly target appointments by stable ID, covering edge cases like duplicate patient names and cross-list operations.",
  "frontend/src/App.tsx": "Root React component that handles authentication state, profile setup, and renders the authenticated shell with tab-based navigation (Schedule, Patients, Leads, Settings).",
  "frontend/src/components/admin/AdminGateDialog.tsx": "A dialog component that handles admin authentication, supporting first-time password setup (with security question) and subsequent password verification using SHA-256 hashing.",
  "frontend/src/components/admin/PermissionsMatrix.tsx": "A staff management UI component that allows adding new staff members with a name and role, and deleting existing ones, backed by query hooks for CRUD operations.",
  "frontend/src/components/AppointmentCard.tsx": "Displays a single appointment with time, patient name, action buttons (WhatsApp, edit, delete, feedback), and a doctor assignment dropdown.",
  "frontend/src/components/AppointmentDialog.tsx": "Modal dialog for creating or editing appointments with fields for patient name, mobile, date/time picker, and notes, including contact picker integration.",
  "frontend/src/components/AppointmentFeedbackActions.tsx": "Renders a feedback button that validates a patient's mobile number and opens a WhatsApp feedback preview dialog for post-appointment feedback requests.",
  "frontend/src/components/AppointmentFeedbackFlyerDialog.tsx": "Empty file with no content.",
  "frontend/src/components/AppointmentReminderOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/AuthenticatedShell.tsx": "Layout wrapper for authenticated users providing a header, left sidebar, bottom navigation, and main content area.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with icons and labels for Schedule, Patients, Leads, and Settings tabs.",
  "frontend/src/components/ContactImportReviewDialog.tsx": "Dialog that lets users review and edit an imported contact's name and mobile number before confirming the import.",
  "frontend/src/components/ExportFormatDialog.tsx": "A dialog component that lets users choose between JSON (labeled as PDF) or CSV (labeled as Excel) export formats, then calls an onConfirm callback with the selected format.",
  "frontend/src/components/FollowUpDateTimeDialog.tsx": "A dialog component for scheduling a follow-up appointment by selecting a date and 12-hour time, converting the result to a BigInt nanosecond timestamp before calling onConfirm.",
  "frontend/src/components/Header.tsx": "A sticky top header displaying the clinic name, sync status, and a user dropdown menu with logout functionality using Internet Identity.",
  "frontend/src/components/LeadCard.tsx": "A card component for displaying a lead's details with actions for calling, WhatsApp messaging (with template selection), editing, deleting, and updating lead status.",
  "frontend/src/components/LeadDialog.tsx": "A dialog form for creating or editing a lead, supporting contact picker import, fields for treatment/follow-up info, and optionally adding the lead as an appointment.",
  "frontend/src/components/LeftSidebar.tsx": "A slide-in sidebar component providing staff attendance check-in functionality and a logout option, displaying today's attendance records.",
  "frontend/src/components/NextAppointmentWidget.tsx": "Displays a widget showing the next upcoming appointment for today, including time, patient name, and treatment extracted from notes. Falls back to a 'No Appointment For Today' message if none exist.",
  "frontend/src/components/PatientCard.tsx": "Renders a card UI for a single patient with avatar, contact info, and action buttons for calling, WhatsApp, editing, deleting, viewing prescription history, and adding appointments.",
  "frontend/src/components/PatientDialog.tsx": "A dialog form for adding or editing a patient, supporting name/mobile/area/notes fields, photo capture via camera or file upload, and contact import from the phonebook with a review step.",
  "frontend/src/components/PatientPrescriptionHistoryDialog.tsx": "A dialog that fetches and displays the full prescription history for a given patient, sorted by most recent, using the PrescriptionHistoryList component.",
  "frontend/src/components/prescription/FreehandPad.tsx": "A canvas-based freehand drawing pad for prescriptions that supports drawing, erasing, clearing, and saving the canvas content as an ExternalBlob.",
  "frontend/src/components/prescription/PrescriptionCameraCapture.tsx": "A dialog component that activates the device camera to capture a prescription photo, compresses it, and returns it as an ExternalBlob via a callback.",
  "frontend/src/components/prescription/PrescriptionHistoryList.tsx": "Displays a sorted list of past prescriptions, rendering typed text, freehand images, or camera images based on the prescription type, along with timestamps and doctor notes.",
  "frontend/src/components/prescription/PrescriptionTypedForm.tsx": "A simple form component with a monospace textarea for entering typed prescription details such as medicines, dosage, and instructions.",
  "frontend/src/components/PrescriptionEditorDialog.tsx": "A tabbed dialog for creating and saving prescriptions (typed, freehand, or camera-captured) for an appointment, with options to view history and send via WhatsApp.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A mandatory setup dialog that collects the doctor's name and clinic name on first use, saving the profile via a mutation hook before allowing app access.",
  "frontend/src/components/settings/AttendanceSection.tsx": "Displays today's attendance records and a monthly attendance summary with a month selector, fetching data via useGetAllAttendance and exporting it with exportAttendanceData.",
  "frontend/src/components/settings/WhatsAppTemplatesEditor.tsx": "Renders editable textarea fields for five WhatsApp message templates, loading saved values from the backend and allowing individual saves via useSaveWhatsAppTemplate.",
  "frontend/src/components/StaffLoginDialog.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/WhatsAppFeedbackPreviewDialog.tsx": "A confirmation dialog that previews a WhatsApp feedback request message before sending it to a patient, showing the recipient number and message content.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useBackendAwareSync.ts": "Automatically invalidates React Query caches for key data queries every 30 seconds and on window focus/visibility change to keep data fresh.",
  "frontend/src/hooks/useContactPicker.ts": "Provides a pickContact function that uses the browser's Contact Picker API to retrieve a contact's name and phone number, with typed error handling for unsupported environments and permission denials.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useLastSync.ts": "Tracks the last successful React Query cache update for key data queries and returns a human-readable formatted string representing how long ago the sync occurred.",
  "frontend/src/hooks/useLocalStorage.ts": "Empty file with no content.",
  "frontend/src/hooks/useNotifications.ts": "Polls appointments every minute to fire 15-minute-ahead reminders via browser Notification API, a notification sound, and an optional in-app callback.",
  "frontend/src/hooks/useNow.ts": "Returns a Date object that updates at a configurable interval (default 1 minute) to keep time-sensitive UI components current.",
  "frontend/src/hooks/useQueries.ts": "Defines shared TypeScript types (Appointment, Patient, Lead, Prescription, etc.) and React Query hooks for fetching and mutating clinic data via an ICP actor, including filtered appointment views for today, tomorrow, and upcoming.",
  "frontend/src/hooks/useSyncOnFocus.ts": "Empty file with no content.",
  "frontend/src/hooks/useSyncStatus.ts": "Custom hook that monitors the React Query cache and returns a boolean indicating whether any key data queries (appointments, patients, leads, profile) are currently fetching.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives, defines CSS custom properties for light/dark themes using OKLCH colors, custom scrollbar styles, and enlarged React Day Picker calendar overrides.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging (cn) and date/time formatting helpers including 12-hour time, DD/MM/YY date, and combined datetime formats supporting both Date objects and bigint timestamps.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LeadsTab.tsx": "Leads management page that displays a searchable, sorted list of leads with add/edit dialogs and quick-launch buttons for Instagram and WhatsApp apps.",
  "frontend/src/pages/LoginPage.tsx": "Login page that presents a branded card with an Internet Identity login button, handling loading and error states.",
  "frontend/src/pages/PatientsTab.tsx": "Patients management page with a searchable patient list, loading/empty states, and a floating action button to open an add/edit patient dialog.",
  "frontend/src/pages/ScheduleTab.tsx": "Main schedule page that displays today's, tomorrow's, and upcoming appointments grouped by time, with support for editing, deleting, calling, WhatsApp messaging, follow-up scheduling, and prescription management.",
  "frontend/src/pages/SettingsTab.tsx": "Settings page with tabs for user profile editing, data export (PDF/Excel), WhatsApp templates, admin permissions, and attendance, plus logout and app-sharing functionality.",
  "frontend/src/pages/WidgetView.tsx": "Standalone widget view that fetches appointments and displays the next upcoming appointment's time, patient name, and treatment in a styled card.",
  "frontend/src/staff/useStaffPermissions.ts": "Empty file, likely a placeholder for a custom hook to manage staff permission logic.",
  "frontend/src/staff/useStaffSession.ts": "Empty file, likely a placeholder for a custom hook to manage staff session state.",
  "frontend/src/types/index.ts": "Re-exports all shared TypeScript types from the useQueries hook for backward compatibility across the codebase.",
  "frontend/src/utils/attendanceExport.ts": "Utility that processes attendance records to compute per-staff, per-month present and absent day counts for the current year, returning structured data keyed by staff name.",
  "frontend/src/utils/exportUtils.ts": "Provides JSON and CSV export functions for appointments, patients, leads, and attendance data, with backward-compatible aliases mapping PDF/Excel export calls to JSON/CSV implementations.",
  "frontend/src/utils/imageCompression.ts": "Async utility that compresses an image file to under a specified byte limit by iteratively reducing JPEG quality and canvas dimensions using the Canvas API.",
  "frontend/src/utils/leadAnalysis.ts": "Provides functions to categorize leads by treatment type, determine if a lead has been converted to an appointment, and compute conversion statistics per treatment category.",
  "frontend/src/utils/notificationSound.ts": "Plays a two-tone (E5→C5) notification beep using the Web Audio API with a fade-in/out envelope, then cleans up the audio context after playback.",
  "frontend/src/utils/phone.ts": "Exports a `normalizePhone` function that strips spaces, hyphens, parentheses, and dots from a phone number string for consistent matching.",
  "frontend/src/utils/treatment.ts": "Provides helpers to extract treatment info from appointment notes (preferring a 'Treatment:' prefix), normalize treatment strings, and compare two treatments for equality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove parameters from the URL hash without reloading.",
  "frontend/src/utils/whatsappFeedback.ts": "Generates and opens WhatsApp feedback/review request URLs using a default or custom message template, with mobile number validation.",
  "frontend/src/utils/whatsappPrescription.ts": "Sends a prescription via WhatsApp as either a prefilled text message (typed) or a shared image file using the Web Share API, with fallbacks for unsupported browsers.",
  "frontend/src/utils/whatsappTemplates.ts": "Defines default WhatsApp message templates for lead communication (initial contact, follow-up, appointment scheduling) and exports functions to generate and open personalized WhatsApp messages for leads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius variables, accordion keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the project's current state including version, architectural notes, known issues, existing implemented features, and new feature requests for a medical scheduling application."
}