{
  "backend/main.mo": "Main Motoko actor for the clinic management backend, defining data types (Appointment, Patient, Lead, Prescription, etc.) and managing per-user data stores with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the NextAppointmentWidget was updated to only consider today's appointments, with references to the affected files and test ID REQ-1.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing the purpose and key details of every component, hook, page, and utility in the project.",
  "frontend/GO_LIVE.md": "Deployment guide for pushing the McDerma Clinic Management app to the Internet Computer mainnet, including prerequisites, a pre-deployment checklist, and step-by-step deployment instructions.",
  "frontend/index.css": "Global CSS file that sets up Tailwind base/components/utilities and defines CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "Root HTML entry point for the React app, configuring PWA metadata (manifest, icons, apple-mobile-web-app tags) and registering the service worker on load.",
  "frontend/public/manifest.json": "PWA web app manifest for McDerma Clinic Management, specifying app name, icons, display mode, theme colors, and categories for installability.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for static assets and a network-first strategy for navigation requests, while bypassing the cache for ICP canister API calls.",
  "frontend/QA_APPOINTMENTS_ID_REGRESSION_TEST.md": "QA regression test plan with eight scenarios verifying that appointment edit and delete operations correctly target appointments by stable ID, covering duplicate names, cross-list operations, and re-sorting.",
  "frontend/src/App.tsx": "Root application component that handles authentication state, profile setup, and tab-based navigation between Schedule, Patients, Leads, and Settings pages within an authenticated shell.",
  "frontend/src/components/admin/AdminGateDialog.tsx": "Admin authentication dialog that handles first-time password setup (with security question) or password verification to grant access to admin settings.",
  "frontend/src/components/admin/PermissionsMatrix.tsx": "React component for managing clinic staff members, allowing admins to add new staff with a name and role, and delete existing staff, using query hooks and toast notifications.",
  "frontend/src/components/AppointmentCard.tsx": "Displays a single appointment's details (time, patient name, notes) with action buttons for WhatsApp, edit, delete, follow-up, prescriptions, and doctor assignment via a dropdown.",
  "frontend/src/components/AppointmentDialog.tsx": "Modal dialog for creating or editing appointments, with fields for patient name, mobile, date/time picker, and notes, supporting contact picker import and patient lookup.",
  "frontend/src/components/AppointmentFeedbackActions.tsx": "Renders a feedback button that validates a patient's mobile number and opens a WhatsApp feedback preview dialog using configurable message templates.",
  "frontend/src/components/AppointmentFeedbackFlyerDialog.tsx": "Empty file with no content.",
  "frontend/src/components/AppointmentReminderOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/AuthenticatedShell.tsx": "Layout wrapper for authenticated users that composes the Header, LeftSidebar, BottomNav, and a main content area around the active tab's children.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with icons and labels for Schedule, Patients, Leads, and Settings tabs, highlighting the currently active tab.",
  "frontend/src/components/ContactImportReviewDialog.tsx": "Dialog that lets users review and edit an imported contact's name and mobile number before confirming the import.",
  "frontend/src/components/ExportFormatDialog.tsx": "Dialog that lets users choose between JSON (labeled PDF) or CSV (labeled Excel) export formats before triggering an export action.",
  "frontend/src/components/FollowUpDateTimeDialog.tsx": "A dialog component for scheduling a follow-up appointment, allowing users to select a date and 12-hour time (hour, minute, AM/PM), then converts the selection to a BigInt nanosecond timestamp before calling the onConfirm callback.",
  "frontend/src/components/Header.tsx": "A sticky app header displaying the clinic name, sync status, and a user dropdown menu with logout functionality using Internet Identity.",
  "frontend/src/components/LeadCard.tsx": "A card component for displaying a lead's details with actions for calling, WhatsApp messaging (via template selection dialog), editing, deleting, and updating lead status inline.",
  "frontend/src/components/LeadDialog.tsx": "A dialog form for creating or editing a lead, supporting contact picker import, fields for treatment/follow-up/rating/status, and optionally adding the lead as an appointment.",
  "frontend/src/components/LeftSidebar.tsx": "A slide-in sidebar menu providing staff attendance check-in functionality and a logout option, displaying today's attendance records.",
  "frontend/src/components/NextAppointmentWidget.tsx": "A widget that displays the next upcoming appointment for today (patient name, time, and treatment), or a placeholder message if none exist.",
  "frontend/src/components/PatientCard.tsx": "Displays a patient's info (name, phone, area, notes, image) in a card with action buttons for calling, WhatsApp, editing, deleting, viewing prescription history, and scheduling appointments.",
  "frontend/src/components/PatientDialog.tsx": "Modal form for adding or editing a patient, supporting name/mobile/area/notes fields, photo capture via camera or file, and contact import from the phonebook with a review step.",
  "frontend/src/components/PatientPrescriptionHistoryDialog.tsx": "Dialog that fetches and displays the full prescription history for a given patient, sorted by most recent, using PrescriptionHistoryList.",
  "frontend/src/components/prescription/FreehandPad.tsx": "Canvas-based freehand drawing pad component that supports mouse and touch input, eraser mode, clear, and saving the drawing as an ExternalBlob PNG.",
  "frontend/src/components/prescription/PrescriptionCameraCapture.tsx": "Dialog component that activates the device camera to capture a prescription photo, compresses it, and returns it as an ExternalBlob via a callback.",
  "frontend/src/components/prescription/PrescriptionHistoryList.tsx": "Displays a sorted list of past prescriptions with type icons and timestamps, rendering typed text or images for freehand/camera prescription types.",
  "frontend/src/components/prescription/PrescriptionTypedForm.tsx": "Simple form component with a monospace textarea for entering typed prescription details such as medicines, dosage, and instructions.",
  "frontend/src/components/PrescriptionEditorDialog.tsx": "Multi-tab dialog for creating a prescription (typed, freehand, or camera) for an appointment, with options to save and send via WhatsApp, plus a history tab.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Mandatory setup dialog that collects the doctor's name and clinic name on first use and saves the profile via a mutation hook.",
  "frontend/src/components/settings/AttendanceSection.tsx": "Settings section that displays today's staff attendance records and a monthly attendance summary with a month selector, pulling data from the attendance query hook.",
  "frontend/src/components/settings/WhatsAppTemplatesEditor.tsx": "React component that displays and edits WhatsApp message templates (appointment reminders, feedback, lead messages) with per-template save functionality using query hooks and toast notifications.",
  "frontend/src/components/StaffLoginDialog.tsx": "Empty file with no content.",
  "frontend/src/components/WhatsAppFeedbackPreviewDialog.tsx": "Dialog that previews a WhatsApp feedback-request message before sending, showing the recipient number and message text with confirm/cancel actions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with the user's Internet Identity or anonymously, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useBackendAwareSync.ts": "Hook that automatically invalidates React Query caches every 30 seconds and on window focus/visibility change to keep backend data fresh.",
  "frontend/src/hooks/useContactPicker.ts": "Hook that wraps the browser Contact Picker API to select a contact's name and phone number, with typed error handling for unsupported devices, permission denial, and empty selections.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useLastSync.ts": "Hook that tracks the last successful React Query cache update for key data queries and returns a human-readable formatted timestamp string.",
  "frontend/src/hooks/useLocalStorage.ts": "Empty file with no content.",
  "frontend/src/hooks/useNotifications.ts": "Hook that checks appointments every minute and fires browser notifications, plays a sound, and triggers an in-app callback when an appointment is within 15 minutes.",
  "frontend/src/hooks/useNow.ts": "Hook that returns the current date/time and updates it at a configurable interval (default 60 seconds) to keep time-sensitive UI components fresh.",
  "frontend/src/hooks/useQueries.ts": "Central module defining shared TypeScript types and React Query hooks for all backend data operations including appointments, patients, leads, staff, attendance, prescriptions, and WhatsApp templates.",
  "frontend/src/hooks/useSyncOnFocus.ts": "Empty file with no content.",
  "frontend/src/hooks/useSyncStatus.ts": "Hook that monitors the React Query cache and returns a boolean indicating whether any key data queries (appointments, patients, leads, profile) are currently fetching.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind, defines CSS custom properties for light/dark themes using oklch colors, and includes custom scrollbar styles and enlarged React Day Picker calendar overrides.",
  "frontend/src/lib/utils.ts": "Utility module exporting a Tailwind class merger (`cn`) and several date/time formatting helpers for 12-hour time, DD/MM/YY dates, and bigint nanosecond timestamps.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with React Query and Internet Identity providers wrapping the root `App` component.",
  "frontend/src/pages/LeadsTab.tsx": "Leads management page that displays a searchable, follow-up-date-sorted list of lead cards with options to add/edit leads and quick-launch buttons for Instagram and WhatsApp apps.",
  "frontend/src/pages/LoginPage.tsx": "Login page that presents a branded card with an Internet Identity login button, handling loading and error states via the `useInternetIdentity` hook.",
  "frontend/src/pages/PatientsTab.tsx": "Patients management page with a searchable patient list, loading/empty states, and a floating action button to open the add/edit patient dialog.",
  "frontend/src/pages/ScheduleTab.tsx": "Schedule page showing today's, tomorrow's, and upcoming appointments with support for editing, deleting, calling, WhatsApp messaging, follow-up scheduling, and prescription editing via various dialogs.",
  "frontend/src/pages/SettingsTab.tsx": "Settings page with tabs for user profile editing, data export (PDF/Excel), WhatsApp templates, admin permissions, and attendance management. Handles logout, app sharing, and export format selection via dialogs.",
  "frontend/src/pages/WidgetView.tsx": "Minimal widget page that displays the next upcoming appointment for today, showing patient name, time, and treatment. Shows a 'No Appointment For Today' state when none are found.",
  "frontend/src/staff/useStaffPermissions.ts": "Empty file, likely a placeholder for a custom hook to manage staff permissions.",
  "frontend/src/staff/useStaffSession.ts": "Empty file, likely a placeholder for a custom hook to manage staff session state.",
  "frontend/src/types/index.ts": "Re-exports all shared TypeScript types from the useQueries hook for backward compatibility across the application.",
  "frontend/src/utils/attendanceExport.ts": "Processes raw attendance records into a structured per-staff, per-month summary including present days, absent days, and absent dates for the current year.",
  "frontend/src/utils/exportUtils.ts": "Provides JSON and CSV export functions for appointments, patients, leads, and attendance data, with backward-compatible aliases mapping PDF/Excel names to JSON/CSV implementations.",
  "frontend/src/utils/imageCompression.ts": "Compresses an image File to under a specified byte limit using canvas, iteratively reducing JPEG quality and dimensions until the target size is met.",
  "frontend/src/utils/leadAnalysis.ts": "Categorizes leads into treatment categories (Hair Transplant, Skin, Other), checks if a lead has been converted to an appointment, and computes per-category conversion statistics.",
  "frontend/src/utils/notificationSound.ts": "Plays a short two-tone notification beep using the Web Audio API with a sine wave oscillator and gain envelope.",
  "frontend/src/utils/phone.ts": "Exports a single normalizePhone utility that strips spaces, hyphens, parentheses, and dots from phone number strings for consistent matching.",
  "frontend/src/utils/treatment.ts": "Provides utilities to extract treatment info from appointment notes, normalize treatment strings, and check if two treatment strings match after normalization.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers to maintain values like admin tokens across navigation.",
  "frontend/src/utils/whatsappFeedback.ts": "Generates and opens WhatsApp feedback URLs with a default or custom Google review message, including mobile number validation and sanitization.",
  "frontend/src/utils/whatsappPrescription.ts": "Sends prescriptions via WhatsApp as either a text message (typed) or a shared image file using the Web Share API, with fallbacks for unsupported browsers.",
  "frontend/src/utils/whatsappTemplates.ts": "Defines default WhatsApp message templates for lead communication (initial contact, follow-up, appointment scheduling) and provides functions to generate personalized messages and open WhatsApp with them.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, extended border radius, box shadow, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project state for a healthcare scheduling app at schema version 1.0.0, noting a stuck loading spinner bug in deployment Version 74 and a pending feature request to restrict the Next Appointment widget to today's appointments only."
}