{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Next Appointment Widget: Show Only Today's Appointments",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update NextAppointmentWidget to only show appointments from today's section, never from tomorrow or upcoming",
      "acceptanceCriteria": [
        "The Next Appointment widget only evaluates appointments that belong to today's appointment section.",
        "If today has future appointments, the widget shows the next one chronologically.",
        "If today has no appointments at all (or all of today's appointments have already passed), the widget displays 'No Appointment For Today'.",
        "Appointments from tomorrow or the upcoming section are never shown in the Next Appointment widget.",
        "The same logic applies in WidgetView.tsx if it also renders next-appointment data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NextAppointmentWidget.tsx",
          "operation": "modify",
          "description": "Refactor the widget to only consider appointments from the today's section when determining the next upcoming appointment. Replace any logic that pulls from all appointments with filtering that explicitly uses only today's date range. Ensure the widget displays 'No Appointment For Today' when today has no future appointments, even if tomorrow or upcoming sections have appointments. Use the useTodayAppointments hook or equivalent filtering logic to get today-only appointments, then find the next chronologically upcoming one from that filtered list. Do not reference useAllAppointments or include appointments outside today's date boundary."
        },
        {
          "path": "frontend/src/pages/WidgetView.tsx",
          "operation": "modify",
          "description": "Update the standalone widget view to apply the same today-only appointment filtering logic as NextAppointmentWidget.tsx. Ensure it fetches appointments using useTodayAppointments or applies date filtering to show only today's next appointment. Display 'No Appointment For Today' when today has no future appointments, regardless of tomorrow's or upcoming appointments. Keep the existing styled card layout but ensure the data source is limited to today's appointment section only."
        }
      ]
    }
  ]
}