{
  "backend/main.mo": "Main backend actor managing users, authentication, appointments, patients, leads, and storage with initialization helpers and registration logic.",
  "backend/migration.mo": "Migration module converting old user data to a new format by adding leadStatus to each lead and returning updated actor state.",
  "feature_evidence.json": "Feature evidence report mapping specific feature requests to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of concise summaries describing the purpose of each frontend source file.",
  "frontend/GO_LIVE.md": "Guide outlining prerequisites and step-by-step instructions for deploying the app to Internet Computer mainnet.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode values, and base styling.",
  "frontend/index.html": "HTML entry file setting up metadata, icons, root container, and service worker registration for the frontend app.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, display mode, and metadata for installation.",
  "frontend/public/sw.js": "Service worker that caches static assets, cleans old caches, and serves cached or network responses based on request type.",
  "frontend/QA_APPOINTMENTS_ID_REGRESSION_TEST.md": "QA test plan validating appointment edit/delete correctness using stable appointment IDs across scenarios.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, tab navigation, and global providers for queries and notifications.",
  "frontend/src/components/AppointmentCard.tsx": "UI card showing appointment details with actions for calling, messaging, editing, deleting, adding to patients, and sending follow‑up.",
  "frontend/src/components/AppointmentDialog.tsx": "Dialog for creating or editing appointments, including contact import, form handling, and submit logic.",
  "frontend/src/components/AppointmentFeedbackActions.tsx": "Component providing WhatsApp feedback request actions with validation and preview dialog.",
  "frontend/src/components/AppointmentFeedbackFlyerDialog.tsx": "Empty file placeholder for a flyer dialog component.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar allowing users to switch between the main app tabs.",
  "frontend/src/components/ContactImportReviewDialog.tsx": "Dialog for reviewing and confirming imported contact name and mobile before use.",
  "frontend/src/components/FollowUpDateTimeDialog.tsx": "Dialog for selecting a date and 12-hour time, converting it to a bigint timestamp, and returning it via onConfirm.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing clinic info, sync status, user menu, and logout handling.",
  "frontend/src/components/LeadCard.tsx": "Displays lead details with actions for calling, WhatsApp, editing, deleting, and updating lead status.",
  "frontend/src/components/LeadDialog.tsx": "Form dialog for creating or editing leads, including date fields, contact import, and optional appointment creation.",
  "frontend/src/components/PatientCard.tsx": "Card showing patient info with actions for calling, WhatsApp, editing, deleting, and creating appointments.",
  "frontend/src/components/PatientDialog.tsx": "Dialog for adding or editing patients, supporting contact import, camera photo capture, and image upload.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog component for collecting and saving a user's name and clinic name with form validation and loading states.",
  "frontend/src/components/WhatsAppFeedbackPreviewDialog.tsx": "Dialog showing a WhatsApp feedback message preview and destination number before confirming send.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useBackendAwareSync.ts": "Hook that polls backend modification timestamps and invalidates relevant React Query caches when data changes.",
  "frontend/src/hooks/useContactPicker.ts": "Hook providing a contact picker with detailed error handling for unsupported devices and permission issues.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and exposing login state.",
  "frontend/src/hooks/useLastSync.ts": "Hook tracking the last successful data sync time and formatting it into human‑readable text.",
  "frontend/src/hooks/useLocalStorage.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useNotifications.ts": "Hook scheduling appointment reminders via browser notifications or alerts with permission handling and cleanup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as timestamps, user profiles, appointments, patients, and leads.",
  "frontend/src/hooks/useSyncOnFocus.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useSyncStatus.ts": "Tracks whether any key data queries are currently fetching and returns a boolean sync status.",
  "frontend/src/index.css": "Configures Tailwind base styles, color variables, dark mode theme, scrollbars, and global transitions.",
  "frontend/src/lib/utils.ts": "Provides utility functions for merging class names and formatting dates and timestamps into 12-hour strings.",
  "frontend/src/main.tsx": "Initializes React, sets up React Query and Internet Identity providers, and renders the app.",
  "frontend/src/pages/LeadsTab.tsx": "Displays and manages leads, including listing, sorting, searching, and opening dialogs for add/edit operations.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login UI and triggers Internet Identity authentication with loading and error handling.",
  "frontend/src/pages/PatientsTab.tsx": "Shows a searchable list of patients and provides dialogs for adding or editing patient records.",
  "frontend/src/pages/ScheduleTab.tsx": "Displays today's, tomorrow's, and upcoming appointments with edit and follow‑up scheduling functionality.",
  "frontend/src/pages/SettingsTab.tsx": "Settings UI enabling clinic name editing, data export, PWA install prompt, and manual sync by invalidating queries and updating sync time.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces for Appointment, Patient, and Lead entities.",
  "frontend/src/utils/phone.ts": "Provides a utility to normalize phone numbers by removing whitespace.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values, supporting hash-based routing.",
  "frontend/src/utils/whatsappFeedback.ts": "Generates WhatsApp feedback messages and URLs, including mobile validation and opening WhatsApp.",
  "frontend/tailwind.config.js": "Tailwind configuration with extended theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing features, pending requests, issues, and architecture notes for syncing and UI updates."
}