{
  "backend/main.mo": "Motoko backend defining user data structures, access control, storage mixins, and registration/login logic with automatic initialization of per-user state.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test references for recent UI and import-flow enhancements.",
  "frontend-file-summaries.txt": "Collection of concise summaries for all frontend files, describing component behavior, UI layouts, hooks, and page functionality.",
  "frontend/GO_LIVE.md": "Guide outlining prerequisites, checklist items, and steps for deploying the application to the Internet Computer mainnet.",
  "frontend/index.css": "Global Tailwind CSS configuration defining color variables, dark mode overrides, and base styling rules.",
  "frontend/index.html": "HTML entry point setting up metadata, icons, manifest, root container, and service worker registration.",
  "frontend/public/manifest.json": "PWA manifest configuring app name, icons, display mode, theme colors, and metadata for installation behavior.",
  "frontend/public/sw.js": "Service worker that caches static assets, cleans old caches, and serves cached or network responses depending on request type.",
  "frontend/QA_APPOINTMENTS_ID_REGRESSION_TEST.md": "QA test plan validating appointment edit/delete correctness using stable IDs across all schedule views and scenarios.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, tab navigation, and global providers.",
  "frontend/src/components/AppointmentCard.tsx": "Displays an appointment with actions for calling, WhatsApp reminders, editing, deleting, and adding to patients.",
  "frontend/src/components/AppointmentDialog.tsx": "Dialog for creating or editing appointments with form handling, contact import, and submission logic.",
  "frontend/src/components/AppointmentFeedbackActions.tsx": "Provides WhatsApp feedback request actions with validation and preview dialog.",
  "frontend/src/components/AppointmentFeedbackFlyerDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar allowing tab switching between schedule, patients, leads, and settings.",
  "frontend/src/components/ContactImportReviewDialog.tsx": "Dialog for reviewing and editing imported contact data before use.",
  "frontend/src/components/Header.tsx": "Header showing clinic info, sync status, user menu, and logout functionality.",
  "frontend/src/components/LeadCard.tsx": "Renders a compact lead card with call/WhatsApp actions, follow-up info, rating, and delete/edit controls.",
  "frontend/src/components/LeadDialog.tsx": "Dialog for creating or editing leads, including contact picker integration, date fields, and form submission logic.",
  "frontend/src/components/PatientCard.tsx": "Displays a patient profile card with avatar, contact actions, area info, and edit/delete/appointment options.",
  "frontend/src/components/PatientDialog.tsx": "Form dialog for adding or updating patients with image capture/upload, contact import, and notes.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Forces initial profile setup by collecting username and clinic name and saving them via a mutation.",
  "frontend/src/components/WhatsAppFeedbackPreviewDialog.tsx": "Shows a preview of a generated WhatsApp feedback message and lets the user confirm sending it.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useBackendAwareSync.ts": "Hook that polls the backend, compares timestamps with cached data, and invalidates React Query caches when newer backend data exists.",
  "frontend/src/hooks/useContactPicker.ts": "Provides a wrapper for the Contact Picker API and returns selected name and mobile number with structured error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Creates and manages an Internet Identity authentication context, handling login flow, stored identities, and authentication state.",
  "frontend/src/hooks/useLastSync.ts": "Tracks and formats the last successful data sync time based on React Query cache updates.",
  "frontend/src/hooks/useLocalStorage.ts": "Empty file.",
  "frontend/src/hooks/useNotifications.ts": "Schedules browser notifications or fallback alerts for upcoming appointments, requesting permission when needed.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including appointments, patients, leads, and user profile.",
  "frontend/src/hooks/useSyncOnFocus.ts": "Empty file.",
  "frontend/src/hooks/useSyncStatus.ts": "Monitors React Query fetch states and reports whether any data queries are currently syncing.",
  "frontend/src/index.css": "Tailwind CSS setup defining color themes, dark mode variables, scrollbar styling, and global transitions.",
  "frontend/src/lib/utils.ts": "Utility functions for merging class names and formatting dates or bigint timestamps into 12‑hour time strings.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, and the Internet Identity provider.",
  "frontend/src/pages/LeadsTab.tsx": "Leads management tab showing sorted leads, loading states, and an add/edit dialog.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with loading states and error handling.",
  "frontend/src/pages/PatientsTab.tsx": "Patients tab with search, list display, loading states, and an add/edit patient dialog.",
  "frontend/src/pages/ScheduleTab.tsx": "Schedule tab showing today, tomorrow, and upcoming appointments with edit support and loading states.",
  "frontend/src/pages/SettingsTab.tsx": "Settings tab for editing clinic profile, syncing data, exporting, and PWA installation prompts.",
  "frontend/src/types/index.ts": "TypeScript interfaces defining Appointment, Patient, and Lead data shapes.",
  "frontend/src/utils/phone.ts": "Provides a function to normalize phone numbers by removing whitespace.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from the URL.",
  "frontend/src/utils/whatsappFeedback.ts": "Generates a predefined WhatsApp feedback message, validates mobile numbers, and builds or opens WhatsApp feedback URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and registering typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's schema version, architecture notes, known issues, generated assets, and existing feature definitions for the McDerma app."
}