{
  "backend/main.mo": "Main actor implementing a multi-tenant clinic management system with Internet Identity authentication, storing per-user appointments, patients, leads, staff, attendance, prescriptions, WhatsApp templates, and admin config with role-based access control and blob storage for images.",
  "backend/migration.mo": "Empty migration module with placeholder types and a no-op run function for future data migration support.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components describing authentication flow, tab navigation, appointment/patient/lead management, prescription editor, staff permissions, WhatsApp templates, and data export functionality.",
  "frontend/GO_LIVE.md": "Deployment guide for publishing the McDerma Clinic Management application to Internet Computer mainnet, including prerequisites, pre-deployment checklist, and step-by-step deployment instructions.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, service worker registration script, and references to app icons for mobile installation.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, display mode (standalone), theme colors, and metadata for installing McDerma Clinic Management System as a mobile app.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets and network-first for navigation requests, with cache cleanup on activation and skipping of canister API calls.",
  "frontend/QA_APPOINTMENTS_ID_REGRESSION_TEST.md": "QA test plan verifying that appointment edit and delete operations correctly target appointments by stable ID across Today/Tomorrow/Upcoming lists, including scenarios with duplicate patient names and cross-list operations.",
  "frontend/src/App.tsx": "Main application component that sets up React Query, handles routing (hash-based), authentication via Internet Identity, and renders different tabs (Schedule, Patients, Leads, Settings) or widget view based on route and user authentication state. Includes staff session management with permission-based tab access.",
  "frontend/src/components/admin/AdminGateDialog.tsx": "Dialog component for admin authentication that handles both initial password setup and subsequent unlock flows using SHA-256 hashed numeric passwords and security questions.",
  "frontend/src/components/admin/PermissionsMatrix.tsx": "Staff permissions management interface that displays a matrix of access rights (appointments, patients, leads, settings, full control) for each staff member with ability to add new staff and save permission changes.",
  "frontend/src/components/AppointmentCard.tsx": "Displays a single appointment with patient details, time/date, and action buttons for calling, WhatsApp messaging, editing, deleting, adding to patients list, and creating follow-ups or prescriptions. Includes confirmation dialogs and feedback actions.",
  "frontend/src/components/AppointmentDialog.tsx": "Modal dialog for creating or editing appointments with form fields for patient name, mobile, date/time (12-hour format), and notes. Supports contact picker integration with review dialog and prefilled data.",
  "frontend/src/components/AppointmentFeedbackActions.tsx": "Provides a button to send WhatsApp feedback requests to patients after appointments, with mobile validation and a preview dialog before sending using configured templates.",
  "frontend/src/components/AppointmentFeedbackFlyerDialog.tsx": "Empty file with no content.",
  "frontend/src/components/AppointmentReminderOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/AuthenticatedShell.tsx": "Layout wrapper for authenticated users that includes Header, LeftSidebar, BottomNav, and StaffLoginDialog, managing sidebar state and staff login dialog visibility.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar displaying tabs (Schedule, Patients, Leads, Settings) with icons, filtering tabs based on staff permissions and highlighting the active tab.",
  "frontend/src/components/ContactImportReviewDialog.tsx": "Modal dialog for reviewing and editing contact information (name and mobile) imported from the device phonebook before confirming its use in the application.",
  "frontend/src/components/FollowUpDateTimeDialog.tsx": "A dialog component for scheduling follow-up appointments with date and time pickers (12-hour format). Converts selected date/time to nanosecond timestamp (BigInt) and calls onConfirm callback.",
  "frontend/src/components/Header.tsx": "Application header component displaying clinic name, sync status, and user dropdown menu with logout functionality. Includes mobile hamburger menu toggle and uses Internet Identity for authentication.",
  "frontend/src/components/LeadCard.tsx": "Card component displaying lead information with actions for call, WhatsApp messaging (with template selection), status updates, edit, and delete. Includes confirmation dialogs for destructive actions.",
  "frontend/src/components/LeadDialog.tsx": "Form dialog for creating or editing leads with fields for contact info, treatment details, dates, rating, and optional appointment creation. Includes contact picker integration for importing from device phonebook.",
  "frontend/src/components/LeftSidebar.tsx": "Collapsible sidebar component for staff-related actions including staff login, auto attendance, and logout. Displays current staff session info and adapts between mobile overlay and desktop sticky layout.",
  "frontend/src/components/NextAppointmentWidget.tsx": "Widget component that displays the next upcoming appointment with time, patient name, and notes. Shows placeholder message when no upcoming appointments exist.",
  "frontend/src/components/PatientCard.tsx": "Displays a patient card with avatar, contact info, and action buttons (call, WhatsApp, edit, delete, view notes, schedule appointment). Includes confirmation dialogs for deletion and modals for notes and appointment scheduling.",
  "frontend/src/components/PatientDialog.tsx": "Modal dialog for adding or editing patient information with fields for name, mobile, area, notes, and image. Supports camera capture, file upload, and contact picker integration with phone normalization and review workflow.",
  "frontend/src/components/prescription/FreehandPad.tsx": "Canvas-based drawing component that allows freehand prescription sketching with mouse/touch support, eraser tool, and exports drawings as PNG blobs.",
  "frontend/src/components/prescription/PrescriptionCameraCapture.tsx": "Camera capture dialog for taking prescription photos with preview, retake functionality, and image compression to under 400KB before saving as ExternalBlob.",
  "frontend/src/components/prescription/PrescriptionHistoryList.tsx": "Displays a scrollable list of past prescriptions with different icons and rendering for typed, freehand, and camera prescription types including timestamps.",
  "frontend/src/components/prescription/PrescriptionTypedForm.tsx": "Simple textarea form component for entering typed prescription details like medicines, dosage, and instructions.",
  "frontend/src/components/PrescriptionEditorDialog.tsx": "Tabbed dialog for creating prescriptions via typed text, freehand drawing, or camera capture, with prescription history view. Handles saving prescriptions and sending them via WhatsApp with doctor notes.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for initial user profile setup requiring username and clinic name. Cannot be dismissed until profile is saved, with form validation and loading states.",
  "frontend/src/components/settings/AttendanceSection.tsx": "Card component that displays today's staff attendance records with names, roles, and check-in timestamps formatted in 12-hour time.",
  "frontend/src/components/settings/WhatsAppTemplatesEditor.tsx": "React component for editing WhatsApp message templates for appointments and leads, with five template types (reminder, feedback, initial contact, follow-up, appointment scheduling) and placeholder support.",
  "frontend/src/components/StaffLoginDialog.tsx": "Staff login dialog with dropdown selection for staff members that auto-populates role and registers attendance. Creates staff session on successful login.",
  "frontend/src/components/WhatsAppFeedbackPreviewDialog.tsx": "Preview dialog showing formatted feedback request message before sending via WhatsApp. Displays recipient details and message content with confirm/cancel actions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with Internet Identity authentication, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useBackendAwareSync.ts": "Hook that automatically synchronizes data by polling the backend every 30 seconds and invalidating queries on window focus/visibility changes.",
  "frontend/src/hooks/useContactPicker.ts": "Hook that provides access to the browser's Contact Picker API for selecting contacts from the device phonebook, with comprehensive error handling for unsupported browsers and permission issues.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLastSync.ts": "Hook that tracks and formats the last successful data synchronization time by monitoring React Query cache updates for data queries.",
  "frontend/src/hooks/useLocalStorage.ts": "Empty file with no content.",
  "frontend/src/hooks/useNotifications.ts": "Hook that schedules and manages appointment reminders 15 minutes before appointments, using browser notifications when backgrounded or in-app overlays with sound when active.",
  "frontend/src/hooks/useNow.ts": "Hook that returns a periodically-updated current Date object, refreshing every minute by default for time-sensitive UI components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, appointments, patients, leads, prescriptions, attendance, and admin config data via the backend actor. Includes temporary type definitions for Staff, StaffPermissions, and WhatsAppTemplate.",
  "frontend/src/hooks/useSyncOnFocus.ts": "Empty file with no content.",
  "frontend/src/hooks/useSyncStatus.ts": "Custom hook that monitors the fetching status of data queries (appointments, patients, leads, profile) and returns a boolean indicating if any are currently syncing.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark medical-themed color schemes (blue primary, green success, amber warning) and custom scrollbar styling.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging (cn) and formatting timestamps/dates into 12-hour time and DD/MM/YY date formats.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/LeadsTab.tsx": "Displays a searchable, sortable list of leads with add/edit functionality via LeadDialog, showing lead cards filtered by name, mobile, treatment, or area.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication, displaying clinic branding and a login button with loading states and error handling.",
  "frontend/src/pages/PatientsTab.tsx": "Patient management page with search functionality, displaying patient cards in a list with add/edit capabilities via PatientDialog and a floating action button.",
  "frontend/src/pages/ScheduleTab.tsx": "Appointment scheduling interface showing today's, tomorrow's, and upcoming appointments with next appointment widget, follow-up scheduling, prescription editing, and appointment count display.",
  "frontend/src/pages/SettingsTab.tsx": "Settings page component with tabs for profile management, data export/import (JSON/CSV), analytics charts, attendance tracking, WhatsApp templates, admin permissions matrix, and app sharing functionality.",
  "frontend/src/pages/WidgetView.tsx": "Widget view component that displays the next upcoming appointment with patient name, time, and treatment details in a card layout.",
  "frontend/src/staff/useStaffPermissions.ts": "Hook that checks staff permissions for accessing different tabs (appointments, patients, leads, settings) based on a permissions matrix, with full control granting all access.",
  "frontend/src/staff/useStaffSession.ts": "Hook managing staff session state in sessionStorage with tab access control based on permissions matrix, defaulting to full access for clinic owners.",
  "frontend/src/types/index.ts": "TypeScript type definitions for core entities: Appointment, Patient, and Lead with their respective properties.",
  "frontend/src/utils/attendanceExport.ts": "Utility function that processes attendance records to calculate present/absent days per month for each staff member in the current year.",
  "frontend/src/utils/imageCompression.ts": "Image compression utility that reduces file size to under 400KB by iteratively adjusting JPEG quality and dimensions using canvas API.",
  "frontend/src/utils/leadAnalysis.ts": "Analytics utility that categorizes leads by treatment type (Hair Transplant, Skin, Other) and calculates conversion rates by matching leads to appointments.",
  "frontend/src/utils/notificationSound.ts": "Plays a two-tone notification beep (E5 to C5) using Web Audio API with fade in/out envelope.",
  "frontend/src/utils/phone.ts": "Normalizes phone numbers by removing whitespace and separators (spaces, hyphens, parentheses, dots) for consistent matching.",
  "frontend/src/utils/treatment.ts": "Treatment string utilities for extracting treatment from notes (with 'Treatment:' prefix detection), normalizing treatment text, and comparing treatments for matching.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/whatsappFeedback.ts": "Handles WhatsApp feedback message generation with default Google review template, validates and sanitizes mobile numbers, and generates WhatsApp URLs for sending feedback messages.",
  "frontend/src/utils/whatsappPrescription.ts": "Sends prescriptions via WhatsApp, handling both typed text prescriptions and image prescriptions using Web Share API with fallbacks for manual sharing.",
  "frontend/src/utils/whatsappTemplates.ts": "Manages WhatsApp message templates for lead communication (initial contact, follow-up, appointment scheduling) with placeholder substitution and mobile number sanitization.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended animations, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking two pending fix requests: implementing backend addLead function to resolve lead save failures, and implementing admin password management backend functions."
}