{
  "backend/main.mo": "Main Motoko actor implementing a clinic management system with Internet Identity authentication, user data storage (appointments, patients, leads, staff, attendance, prescriptions), blob storage for images, access control, and sync functionality with timestamp tracking for data modifications.",
  "feature_evidence.json": "Feature evidence report documenting a calendar visibility fix in the New Appointment dialog, listing affected files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, pages, hooks, and utilities describing their functionality, layout, and data handling patterns.",
  "frontend/GO_LIVE.md": "Deployment guide for launching the McDerma Clinic Management application to Internet Computer mainnet, including prerequisites, pre-deployment checklist, and deployment steps.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, muted, accent, destructive, borders, and charts.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, service worker registration script, and icon references for the McDerma Clinic Management System.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, display mode (standalone), theme colors, orientation, and metadata for the McDerma Clinic Management System.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, network-first for navigation, skipping API calls, with install/activate lifecycle management for offline PWA functionality.",
  "frontend/QA_APPOINTMENTS_ID_REGRESSION_TEST.md": "QA test plan with 8 scenarios verifying that appointment edit and delete operations correctly target appointments by stable ID, handling duplicate names, cross-list operations, and list re-sorting.",
  "frontend/src/App.tsx": "Main application component that handles authentication flow, profile setup, and tab-based navigation between Schedule, Patients, Leads, and Settings pages. Renders LoginPage for unauthenticated users and AuthenticatedShell with tab content for authenticated users.",
  "frontend/src/components/admin/AdminGateDialog.tsx": "Authentication dialog with setup and unlock modes for admin access using numeric-only passwords with SHA-256 hashing. Includes security question setup for password recovery.",
  "frontend/src/components/admin/PermissionsMatrix.tsx": "Staff management component that allows adding new staff members with name, role selection from predefined options, and default permissions initialization using React Query mutations.",
  "frontend/src/components/AppointmentCard.tsx": "Displays appointment details in a card format with actions for calling, WhatsApp messaging, editing, deleting, adding to patients, and scheduling follow-ups or prescriptions. Shows time, date, patient name, and conditional badges for follow-up appointments.",
  "frontend/src/components/AppointmentDialog.tsx": "Modal dialog for creating or editing appointments with fields for patient name, mobile, date/time picker, and notes. Supports prefilled data, contact picker integration, and patient selection from existing records.",
  "frontend/src/components/AppointmentFeedbackActions.tsx": "Provides a button to send WhatsApp feedback requests to patients after appointments. Validates mobile numbers and shows a preview dialog before sending the templated message.",
  "frontend/src/components/AppointmentFeedbackFlyerDialog.tsx": "Empty file with no content.",
  "frontend/src/components/AppointmentReminderOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/AuthenticatedShell.tsx": "Layout wrapper for authenticated users containing Header, LeftSidebar, BottomNav, and main content area. Manages sidebar open/close state and tab navigation.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with icons and labels for Schedule, Patients, Leads, and Settings tabs. Highlights the active tab and handles tab switching.",
  "frontend/src/components/ContactImportReviewDialog.tsx": "Modal dialog for reviewing and editing contact information (name and mobile) imported from device contacts before using it in the application.",
  "frontend/src/components/ExportFormatDialog.tsx": "Modal dialog for selecting export format (JSON or CSV) with radio button options and visual icons. Confirms selection and triggers export callback.",
  "frontend/src/components/FollowUpDateTimeDialog.tsx": "A dialog component for scheduling follow-up appointments with date and time pickers (12-hour format). Converts selected date/time to nanosecond timestamp (bigint) and passes it to onConfirm callback.",
  "frontend/src/components/Header.tsx": "Application header component displaying clinic name, logo, sync status, and user dropdown menu with logout functionality. Includes mobile hamburger menu toggle and uses Internet Identity for authentication.",
  "frontend/src/components/LeadCard.tsx": "Card component displaying lead information with actions for calling, WhatsApp messaging (with template selection), status updates, editing, and deletion. Includes confirmation dialogs for destructive actions.",
  "frontend/src/components/LeadDialog.tsx": "Form dialog for creating or editing leads with fields for contact info, treatment details, dates, ratings, and remarks. Supports contact picker integration and optional appointment creation upon lead submission.",
  "frontend/src/components/LeftSidebar.tsx": "Collapsible sidebar menu with staff attendance check-in functionality and logout option. Displays today's attendance list with check-in times and supports staff selection from dropdown.",
  "frontend/src/components/NextAppointmentWidget.tsx": "Widget displaying the next upcoming appointment with time, patient name, and notes. Shows placeholder message when no upcoming appointments exist.",
  "frontend/src/components/PatientCard.tsx": "Displays a patient card with avatar, contact info, and action buttons (call, WhatsApp, edit, delete, view prescriptions, schedule appointment). Handles patient deletion with confirmation and uses normalized phone numbers for communication.",
  "frontend/src/components/PatientDialog.tsx": "Modal dialog for adding or editing patient information with fields for name, mobile, area, notes, and image. Supports camera capture, file upload, and contact picker integration with phone number normalization and review flow.",
  "frontend/src/components/PatientPrescriptionHistoryDialog.tsx": "Modal dialog that displays a patient's prescription history sorted by timestamp (newest first) using the PrescriptionHistoryList component.",
  "frontend/src/components/prescription/FreehandPad.tsx": "Canvas-based freehand drawing component with drawing/erasing modes, touch/mouse support, and saves drawings as PNG blobs converted to ExternalBlob format.",
  "frontend/src/components/prescription/PrescriptionCameraCapture.tsx": "Camera capture dialog component that uses custom useCamera hook to take photos, compress images to <400KB, and convert to ExternalBlob format for prescription uploads.",
  "frontend/src/components/prescription/PrescriptionHistoryList.tsx": "Displays a scrollable list of prescription history with different icons and rendering for typed, freehand, and camera prescription types, showing timestamps and content previews.",
  "frontend/src/components/prescription/PrescriptionTypedForm.tsx": "Simple textarea form component for entering typed prescription details including medicines, dosage, and instructions with monospace font styling.",
  "frontend/src/components/PrescriptionEditorDialog.tsx": "Tabbed dialog for creating prescriptions with typed, freehand, camera, and history modes. Handles prescription saving, WhatsApp sharing, and ensures patient exists before saving prescriptions.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Non-dismissible modal dialog for initial user profile setup requiring username and clinic name (defaults to 'McDerma'). Blocks interaction until profile is saved.",
  "frontend/src/components/settings/AttendanceSection.tsx": "Displays today's attendance records and monthly attendance summaries with month selection, showing staff check-in times and attendance statistics using React Query data.",
  "frontend/src/components/settings/WhatsAppTemplatesEditor.tsx": "React component for editing WhatsApp message templates for appointments and leads, with five template types (reminder, feedback, initial contact, follow-up, appointment scheduling) and placeholder support.",
  "frontend/src/components/StaffLoginDialog.tsx": "Empty file with no content.",
  "frontend/src/components/WhatsAppFeedbackPreviewDialog.tsx": "Preview dialog for reviewing and confirming feedback request messages before sending via WhatsApp to patients, showing recipient number and message content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Empty authentication hook file with no implementation.",
  "frontend/src/hooks/useBackendAwareSync.ts": "Hook that automatically synchronizes data with the backend every 30 seconds and on window focus by invalidating React Query caches for appointments, patients, leads, and attendance.",
  "frontend/src/hooks/useContactPicker.ts": "Hook that provides access to the browser's Contact Picker API for selecting contacts from the device phonebook, with comprehensive error handling for unsupported browsers and permission issues.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for managing Internet Identity authentication, providing login/logout functionality, identity state management, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useLastSync.ts": "Hook that tracks and formats the last successful data synchronization time by monitoring React Query cache updates, displaying relative time (e.g., '5 mins ago') or 12-hour formatted timestamps.",
  "frontend/src/hooks/useLocalStorage.ts": "Empty local storage hook file with no implementation.",
  "frontend/src/hooks/useNotifications.ts": "Hook that schedules and manages appointment reminder notifications 15 minutes before appointments, supporting both browser notifications and in-app overlays with sound, including permission handling and duplicate prevention.",
  "frontend/src/hooks/useNow.ts": "Hook that returns a periodically-updated current Date object, refreshing every minute by default to keep time-sensitive UI components current.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, appointments, patients, leads, prescriptions, attendance, staff management, and admin configuration with mutations and queries.",
  "frontend/src/hooks/useSyncOnFocus.ts": "Empty file with no content.",
  "frontend/src/hooks/useSyncStatus.ts": "Provides a hook that monitors React Query cache to determine if any data queries (appointments, patients, leads, profile) are currently fetching, returning a boolean sync status.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a medical-themed color palette (blues, greens) in light and dark modes, plus custom scrollbar and calendar (rdp) styling.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging (cn) and date/time formatting including 12-hour time, DD/MM/YY dates, and timestamp conversions from bigint nanoseconds.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/LeadsTab.tsx": "Displays and manages leads with search functionality, add/edit dialogs, and quick-access buttons to open Instagram and WhatsApp apps, showing leads sorted by follow-up date.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with Internet Identity authentication, displaying clinic branding, login button with loading states, and informational text about secure cross-device data synchronization.",
  "frontend/src/pages/PatientsTab.tsx": "Patient management interface with search functionality, patient list display using PatientCard components, empty states, and a floating action button to add new patients via PatientDialog.",
  "frontend/src/pages/ScheduleTab.tsx": "Main schedule view component that displays today's, tomorrow's, and upcoming appointments with dialogs for creating/editing appointments, scheduling follow-ups, and managing prescriptions.",
  "frontend/src/pages/SettingsTab.tsx": "Settings page with tabs for user profile, WhatsApp templates, admin permissions, and attendance management, including export functionality for appointments, patients, leads, and attendance data.",
  "frontend/src/pages/WidgetView.tsx": "Standalone widget view that displays the next upcoming appointment with patient name, time, and treatment details in a card layout.",
  "frontend/src/staff/useStaffPermissions.ts": "Empty file placeholder for staff permissions hook.",
  "frontend/src/staff/useStaffSession.ts": "Empty file placeholder for staff session hook.",
  "frontend/src/types/index.ts": "TypeScript interfaces defining the shape of Appointment, Patient, and Lead entities used throughout the frontend.",
  "frontend/src/utils/attendanceExport.ts": "Utility function that processes attendance records to calculate monthly present/absent days and dates for each staff member in the current year.",
  "frontend/src/utils/exportUtils.ts": "Export utilities that provide JSON and CSV export functions for appointments, patients, leads, and attendance data (PDF/Excel exports currently fallback to JSON/CSV).",
  "frontend/src/utils/imageCompression.ts": "Image compression utility that reduces image file size to under 400KB by iteratively adjusting quality and dimensions using canvas API.",
  "frontend/src/utils/leadAnalysis.ts": "Lead analytics utility that categorizes leads by treatment type (Hair Transplant, Skin Related, Other) and calculates conversion rates by matching leads to appointments.",
  "frontend/src/utils/notificationSound.ts": "Plays a two-tone notification sound (E5 to C5) using the Web Audio API with fade in/out envelope and automatic cleanup.",
  "frontend/src/utils/phone.ts": "Normalizes phone numbers by removing whitespace, hyphens, parentheses, and dots for consistent matching across the application.",
  "frontend/src/utils/treatment.ts": "Extracts treatment information from appointment notes (preferring 'Treatment:' prefix), normalizes treatment strings for comparison, and checks if two treatments match.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and parameter cleanup functionality.",
  "frontend/src/utils/whatsappFeedback.ts": "Generates and validates WhatsApp URLs for sending feedback messages with Google review links, including mobile number validation and sanitization.",
  "frontend/src/utils/whatsappPrescription.ts": "Sends prescriptions via WhatsApp as text messages for typed prescriptions or uses Web Share API to pre-attach image prescriptions with fallback options.",
  "frontend/src/utils/whatsappTemplates.ts": "Manages WhatsApp message templates for lead communication (initial contact, follow-up, appointment scheduling) with placeholder replacement and message generation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata indicating a fix request for a calendar visibility issue where only half of the calendar is shown in the New Appointment dialog."
}