{
  "backend/main.mo": "Main backend canister implementing user registration, authorization mixins, and data storage for profiles, appointments, patients, and leads with per-user maps and timestamps.",
  "feature_evidence.json": "Feature evidence report describing addition of the 'Visited' lead status option and listing affected frontend components and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend source files including components, pages, hooks, and types.",
  "frontend/GO_LIVE.md": "Guide outlining prerequisites and step-by-step instructions for deploying the application to the Internet Computer mainnet.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, light/dark modes, and base styling.",
  "frontend/index.html": "Main HTML entry for the frontend with PWA metadata, icons, root mount point, and service worker registration.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, and display settings.",
  "frontend/public/sw.js": "Service worker implementing asset caching, cache cleanup, and network-first or cache-first strategies for offline support.",
  "frontend/QA_APPOINTMENTS_ID_REGRESSION_TEST.md": "QA test plan verifying correct appointment edit and delete behavior using stable IDs across schedule lists.",
  "frontend/src/App.tsx": "Main app component handling authentication, routing, tab navigation, background sync, and appointment reminder overlay within a React Query provider.",
  "frontend/src/components/AppointmentCard.tsx": "Displays an appointment card with time, patient info, and actions like call, WhatsApp, add patient, delete, and follow‑up.",
  "frontend/src/components/AppointmentDialog.tsx": "Dialog for creating or editing appointments with form handling, contact picker integration, and validation before submitting changes.",
  "frontend/src/components/AppointmentFeedbackActions.tsx": "Provides buttons to send WhatsApp feedback requests, validating the number and showing a preview dialog before sending.",
  "frontend/src/components/AppointmentFeedbackFlyerDialog.tsx": "Empty file with no implementation.",
  "frontend/src/components/AppointmentReminderOverlay.tsx": "Full‑screen overlay showing an upcoming appointment reminder with patient, time, notes, and a dismiss button.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar switching between schedule, patients, leads, and settings tabs.",
  "frontend/src/components/ContactImportReviewDialog.tsx": "Dialog allowing users to review and edit imported contact details before confirming insertion into a form.",
  "frontend/src/components/FollowUpDateTimeDialog.tsx": "Dialog for selecting a date and 12-hour time, converting it to a bigint timestamp, and returning it via onConfirm.",
  "frontend/src/components/Header.tsx": "Top navigation header showing clinic info, sync status, user menu, and logout handling.",
  "frontend/src/components/LeadCard.tsx": "Displays a lead with actions for calling, WhatsApp messaging, editing, deleting, and updating status, including follow‑up and expected dates.",
  "frontend/src/components/LeadDialog.tsx": "Form dialog for creating or editing a lead, handling contact import, date fields, status, rating, and optional appointment creation.",
  "frontend/src/components/NextAppointmentWidget.tsx": "Widget showing the next upcoming appointment or a fallback message if none exist.",
  "frontend/src/components/PatientCard.tsx": "Displays patient details with call/WhatsApp actions, image/avatar, delete flow, and an appointment dialog trigger.",
  "frontend/src/components/PatientDialog.tsx": "Dialog component for creating or editing a patient, supporting contact import, camera/photo capture, and image upload.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal for entering and saving the user’s name and clinic name during initial setup.",
  "frontend/src/components/WhatsAppFeedbackPreviewDialog.tsx": "Shows a preview of a WhatsApp feedback message and confirms sending it to a patient.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user’s Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useBackendAwareSync.ts": "Polls backend change timestamps and invalidates relevant React Query caches when new data is detected.",
  "frontend/src/hooks/useContactPicker.ts": "Wraps the Contact Picker API to select a contact’s name and phone number with detailed error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and identity restoration via AuthClient.",
  "frontend/src/hooks/useLastSync.ts": "Tracks and formats the timestamp of the last successful data sync based on React Query cache updates.",
  "frontend/src/hooks/useLocalStorage.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useNotifications.ts": "Schedules and manages appointment reminders using browser notifications or in-app alerts, including permission handling and sound playback.",
  "frontend/src/hooks/useNow.ts": "Provides a Date value that updates at a fixed interval, defaulting to once per minute.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as appointments, profiles, leads, and sync timestamps.",
  "frontend/src/hooks/useSyncOnFocus.ts": "Empty placeholder file for sync-on-focus logic.",
  "frontend/src/hooks/useSyncStatus.ts": "Tracks whether any key React Query data sources are currently fetching and exposes a boolean sync status.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode settings, transitions, and custom scrollbar styling.",
  "frontend/src/lib/utils.ts": "Contains utility functions for class merging and formatting dates and timestamps into readable strings.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with Internet Identity and React Query providers, and loads global styles.",
  "frontend/src/pages/LeadsTab.tsx": "Displays and manages the leads list with sorting, loading states, and a dialog for adding or editing leads.",
  "frontend/src/pages/LoginPage.tsx": "Implements the Internet Identity login UI with loading states, error handling, and a welcome screen.",
  "frontend/src/pages/PatientsTab.tsx": "Displays a searchable list of patients, handles loading states, and opens a dialog for creating or editing patient records.",
  "frontend/src/pages/ScheduleTab.tsx": "Shows today’s, tomorrow’s, and upcoming appointments, with editing, follow‑up scheduling, and a next‑appointment widget.",
  "frontend/src/pages/SettingsTab.tsx": "Manages clinic profile settings, manual data sync, PWA install handling, and exports, using multiple backend queries.",
  "frontend/src/pages/WidgetView.tsx": "Displays a minimal full‑screen widget showing the next upcoming appointment with time, patient info, and treatment.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces for Appointment, Patient, and Lead entities.",
  "frontend/src/utils/leadAnalysis.ts": "Provides functions to categorize leads, detect converted leads, and compute analytics using appointments data.",
  "frontend/src/utils/notificationSound.ts": "Plays a short notification tone using the Web Audio API.",
  "frontend/src/utils/phone.ts": "Normalizes phone numbers by stripping whitespace and common separators.",
  "frontend/src/utils/treatment.ts": "Extracts treatment info from notes and offers normalization and comparison utilities for treatments.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and removing them from hash-based routing.",
  "frontend/src/utils/whatsappFeedback.ts": "Generates a preset WhatsApp feedback message, validates mobile numbers, and builds or opens WhatsApp URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state metadata, existing features, and a pending request to add a 'Visited' option to the lead status dropdown."
}