{
  "backend/main.mo": "Motoko backend defining user data structures, registration logic, access control, and storage mixins for appointments, patients, and leads.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of key frontend components, pages, and hooks.",
  "frontend/GO_LIVE.md": "Guide outlining prerequisites, checks, and steps for deploying the application to Internet Computer mainnet.",
  "frontend/index.css": "Tailwind CSS configuration defining light/dark theme variables and global styling rules.",
  "frontend/index.html": "HTML entry point setting up metadata, PWA support, icons, and service worker registration.",
  "frontend/public/manifest.json": "PWA manifest configuring app metadata, icons, theme colors, and display behavior.",
  "frontend/public/sw.js": "Service worker implementing asset caching, cache cleanup, and fetch handling for offline support.",
  "frontend/QA_APPOINTMENTS_ID_REGRESSION_TEST.md": "QA test plan verifying correct appointment edit/delete behavior using stable IDs across various scenarios.",
  "frontend/src/App.tsx": "Main app component handling authentication, routing, tab navigation, background sync, notifications, and overall layout.",
  "frontend/src/components/AppointmentCard.tsx": "Displays an appointment card with time, patient info, and actions like call, WhatsApp, add patient, edit, delete, and follow‑up.",
  "frontend/src/components/AppointmentDialog.tsx": "Dialog for creating or editing appointments with form fields, contact picker integration, and submission handlers.",
  "frontend/src/components/AppointmentFeedbackActions.tsx": "Renders buttons to send WhatsApp feedback requests, validating numbers and showing a preview dialog.",
  "frontend/src/components/AppointmentFeedbackFlyerDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/AppointmentReminderOverlay.tsx": "Full‑screen overlay showing an upcoming appointment reminder with details and a dismiss button.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar allowing switching between app tabs with icons and labels.",
  "frontend/src/components/ContactImportReviewDialog.tsx": "Dialog to review and edit imported contact details before confirming use in a form.",
  "frontend/src/components/FollowUpDateTimeDialog.tsx": "A dialog for selecting a date and 12-hour time, converting it to a bigint timestamp, and submitting it via onConfirm.",
  "frontend/src/components/Header.tsx": "Header bar showing clinic info, sync status, user menu, and logout handling.",
  "frontend/src/components/LeadCard.tsx": "Displays lead details with actions for calling, WhatsApp, editing, deleting, and updating lead status.",
  "frontend/src/components/LeadDialog.tsx": "Form dialog for creating or editing a lead, including contact import, date fields, rating, and conditional appointment creation.",
  "frontend/src/components/NextAppointmentWidget.tsx": "Shows the next upcoming appointment or a fallback message when none exist.",
  "frontend/src/components/PatientCard.tsx": "Card displaying patient info with call/WhatsApp actions, delete confirmation, and appointment creation dialog.",
  "frontend/src/components/PatientDialog.tsx": "Dialog for creating or editing a patient with form fields, optional contact import, and camera or file-based image capture.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal form for saving the user's name and clinic name using a profile mutation.",
  "frontend/src/components/WhatsAppFeedbackPreviewDialog.tsx": "Dialog showing a WhatsApp feedback message preview and confirming send action to a patient.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, recreating and invalidating queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useBackendAwareSync.ts": "Polls backend modification timestamps and invalidates queries when newer data is detected, with focus- and mutation-based syncing.",
  "frontend/src/hooks/useContactPicker.ts": "Wrapper around the Contact Picker API to select a contact's name and phone with structured error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login and logout helpers.",
  "frontend/src/hooks/useLastSync.ts": "Tracks last successful React Query sync time and formats it into human‑readable text.",
  "frontend/src/hooks/useLocalStorage.ts": "Empty file.",
  "frontend/src/hooks/useNotifications.ts": "Manages appointment reminders by scheduling in-app or browser notifications 15 minutes before events and tracking fired reminders.",
  "frontend/src/hooks/useNow.ts": "Provides a Date value that updates on a fixed interval, defaulting to once per minute.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating appointments, leads, patients, sync metadata, and user profiles via the backend actor.",
  "frontend/src/hooks/useSyncOnFocus.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useSyncStatus.ts": "Tracks whether any key data queries are currently fetching and returns a global syncing flag.",
  "frontend/src/index.css": "Tailwind base/style configuration with custom theme variables, dark mode values, scrollbars, and global transitions.",
  "frontend/src/lib/utils.ts": "Utility helpers for class merging and date/time formatting from bigint timestamps and Date objects.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, Internet Identity provider, and renders the main application.",
  "frontend/src/pages/LeadsTab.tsx": "Displays, sorts, and manages creation/editing of leads with a floating add button and dialog.",
  "frontend/src/pages/LoginPage.tsx": "Login screen for Internet Identity authentication with UI feedback and error handling.",
  "frontend/src/pages/PatientsTab.tsx": "Displays patient list with search, loading states, and edit/add dialogs.",
  "frontend/src/pages/ScheduleTab.tsx": "Shows today’s, tomorrow’s, and upcoming appointments with edit and follow‑up scheduling.",
  "frontend/src/pages/SettingsTab.tsx": "Provides clinic profile editing, data sync, exports, and PWA install handling.",
  "frontend/src/pages/WidgetView.tsx": "Renders a compact widget showing the next upcoming appointment and treatment details.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces for Appointment, Patient, and Lead entities.",
  "frontend/src/utils/leadAnalysis.ts": "Analyzes leads by categorizing them and determining conversions based on appointments.",
  "frontend/src/utils/notificationSound.ts": "Generates a short notification tone using the Web Audio API.",
  "frontend/src/utils/phone.ts": "Normalizes phone numbers by removing spaces and common separators.",
  "frontend/src/utils/treatment.ts": "Extracts and normalizes treatment text from notes and compares treatment strings.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/src/utils/whatsappFeedback.ts": "Generates WhatsApp feedback messages and URLs, and validates mobile numbers.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s state, issues, and feature requests regarding widget removal and date format changes."
}