{
  "kind": "build_request",
  "title": "Add lead status dropdown on Lead cards and reduce Lead card height",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a lead status dropdown control to each lead entry card in the Leads tab, positioned on the right side below the existing rating display, with exactly these options: (1) Ringing, (2) will call and come, (3) follow up date given.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "On lead section, in lead patient entry can you put a drop down menu on right side below rating containg option 1 - Ringing, 2 - will call and come, 3 - follow up date given."
        ]
      },
      "acceptanceCriteria": [
        "Each LeadCard shows a dropdown on the right side under the rating, visually aligned with the rating block.",
        "Dropdown options are exactly: \"Ringing\", \"will call and come\", \"follow up date given\".",
        "Changing the dropdown value updates the lead locally in the UI without requiring a page refresh (i.e., the lead list reflects the new selected value after the change)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Persist the selected lead status for each lead in backend storage and ensure it is returned by the getLeads query and updated via an update operation.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "put a drop down menu... containg option 1 - Ringing, 2 - will call and come, 3 - follow up date given."
        ]
      },
      "acceptanceCriteria": [
        "Backend Lead data model includes a stored field for lead status.",
        "Existing leads (created before this change) have a valid default status value after upgrade (no crashes/deserialization errors).",
        "When a user changes a lead's dropdown value, the change persists after app reload and appears on other devices after the normal sync/refresh behavior.",
        "React Query leads cache is invalidated/refetched after a successful status change so the UI stays consistent."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Reduce the vertical height of each lead entry card in the Leads section by approximately 20–30% while keeping all existing actions (Call, WhatsApp, Edit, Delete) usable and readable on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also reduce height of entry in lead section from 20 to 30 %."
        ]
      },
      "acceptanceCriteria": [
        "Lead cards display with visibly reduced vertical padding/spacing compared to current layout (target ~20–30% less height).",
        "All current lead information remains present (name, mobile, area, treatment, follow-up, expected date, remark if present) and does not overlap.",
        "Action buttons remain tappable on mobile and are not clipped or pushed off-card."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "If existing stable state needs transformation for the new lead status field, add/adjust backend/migration.mo following the project’s conditional migration policy.",
    "Do not edit any files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT; only compose and use those UI components."
  ],
  "nonGoals": [
    "Do not add new lead filtering, sorting, or analytics based on the new status (only store and display/update it).",
    "Do not change unrelated tabs (Schedule, Patients, Settings) or their UI/logic beyond what is necessary for compilation.",
    "Do not introduce any third-party realtime sync mechanism (e.g., websockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}