{
  "kind": "build_request",
  "title": "Remove Open Widget button and standardize date format to DD/MM/YY",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the Settings UI action that opens the widget view (the “Open Widget View” / open widget button) so users no longer see or can tap a widget-opening button in Settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes remove open widget button."
        ]
      },
      "acceptanceCriteria": [
        "Settings page no longer renders the button labeled “Open Widget View” (or any equivalent open-widget button).",
        "The unused click handler (e.g., `handleOpenWidget`) and related imports (e.g., ExternalLink icon) are removed if no longer needed.",
        "No navigation route or page is required to be deleted; only the Settings open-widget entry point is removed."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the app’s default date display format to DD/MM/YY wherever dates are shown to the user, including date+time strings (date portion) and date-only strings (e.g., exports). Keep time formatting in 12-hour format with AM/PM unless a screen is currently time-only.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And by default date should be in DD/MM/YY FORMAT"
        ]
      },
      "acceptanceCriteria": [
        "Any UI that shows a date (e.g., appointment-related messages, Settings “Last Synced”, exports’ date columns) displays the date portion in DD/MM/YY format.",
        "Places currently using US locale date formatting (e.g., `toLocaleString('en-US'...)`, `toLocaleDateString('en-US'...)`) are updated so the resulting output is DD/MM/YY.",
        "Places currently using date-fns formats for dates (e.g., `format(date, 'MMM dd, yyyy')` / `format(date, 'MMM dd')`) are updated so displayed dates follow DD/MM/YY (2-digit day, 2-digit month, 2-digit year).",
        "No user-facing text is changed except as required by the new date format."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn UI sources); compose them instead.",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Building a native Android/iOS home-screen widget (not supported in this web app).",
    "Adding new widget functionality; this change only removes the Settings button that opens the widget view.",
    "Changing backend data models or stored timestamp formats."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}