{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Lead card status dropdown + compact layout",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a per-lead status dropdown on each LeadCard under the rating on the right, and update status locally on change.",
      "acceptanceCriteria": [
        "Each LeadCard shows a dropdown on the right side under the rating, visually aligned with the rating block.",
        "Dropdown options are exactly: \"Ringing\", \"will call and come\", \"follow up date given\".",
        "Changing the dropdown value updates the lead locally in the UI without requiring a page refresh (i.e., the lead list reflects the new selected value after the change)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LeadCard.tsx",
          "operation": "modify",
          "description": "Add a right-aligned status <select> control below the existing rating display with exactly the three required options; wire its onChange to a new status-update mutation and perform an optimistic React Query cache update so the selected value reflects immediately without refresh."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Wire lead status persistence through existing lead update flow, including React Query invalidation/refetch after status change.",
      "acceptanceCriteria": [
        "Backend Lead data model includes a stored field for lead status.",
        "Existing leads (created before this change) have a valid default status value after upgrade (no crashes/deserialization errors).",
        "When a user changes a lead's dropdown value, the change persists after app reload and appears on other devices after the normal sync/refresh behavior.",
        "React Query leads cache is invalidated/refetched after a successful status change so the UI stays consistent."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update lead mutations to include leadStatus in add/update inputs and calls; add a dedicated useUpdateLeadStatus mutation that calls the backend update capability using the existing lead fields plus the new leadStatus, performs optimistic cache updates for ['leads'], and invalidates/refetches ['leads'] (and related last-modified keys) on success."
        },
        {
          "path": "frontend/src/components/LeadDialog.tsx",
          "operation": "modify",
          "description": "Include leadStatus in LeadDialog form state with a sensible default and ensure both create and edit submissions pass leadStatus through to useAddLead/useUpdateLead so newly created/edited leads keep a consistent persisted status."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Reduce LeadCard vertical height ~20–30% while keeping all information and actions readable and tappable on mobile.",
      "acceptanceCriteria": [
        "Lead cards display with visibly reduced vertical padding/spacing compared to current layout (target ~20–30% less height).",
        "All current lead information remains present (name, mobile, area, treatment, follow-up, expected date, remark if present) and does not overlap.",
        "Action buttons remain tappable on mobile and are not clipped or pushed off-card."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LeadCard.tsx",
          "operation": "modify",
          "description": "Tighten layout spacing to reduce overall card height (reduce CardContent padding, tighten vertical margins/spacing between sections, and compact the remark block) while keeping action buttons at usable tap sizes and ensuring no text overlaps/clips on small screens."
        }
      ]
    }
  ]
}